# Small code snippet to aproximate the number of tokens for different LLMs
# https://towardsdatascience.com/easily-estimate-your-openai-api-costs-with-tiktoken-c17caf6d015e

import tiktoken
import openai
import os

openai.api_key = os.environ["OPENAI_API_MOHD_FASHA_KEY"]

context = """ﻗﺎﻧﻮﻥ ﺍﻟﻌﻘﻮﺑﺎﺕ ﺭﻗﻢ 16 1960/ ﻭﺟﻤﻴﻊ ﺗﻌﺪﻳﻼﺗﻪ ﻭﺍﻟﻤﻨﺸﻮﺭ ﻓﻲ ﺍﻟﺠﺮﻳﺪﺓ ﺍﻟﺮﺳﻤﻴﺔ ﺭﻗﻢ 1487 ﺗﺎﺭﻳﺦ 1960/1/1 ﻭﺍﻟﻤﻌﺪﻝ ﺑﺂﺧﺮ ﻗﺎﻧﻮﻥ ﺭﻗﻢ 2011/8 ﻭﺍﻟﻤﻨﺸﻮﺭ ﻓﻲ ﺍﻟﺠﺮﻳﺪﺓ ﺍﻟﺮﺳﻤﻴﺔ ﺭﻗﻢ 5090 ﺗﺎﺭﻳﺦ 2011/5/2.

ﺍﻟﻤﺎﺩﺓ (1)
ﻳﺴﻤﻰ ﻫﺬﺍ ﺍﻟﻘﺎﻧﻮﻥ (ﻗﺎﻧﻮﻥ ﺍﻟﻌﻘﻮﺑﺎﺕ ﻟﺴﻨﺔ 1960) ﻭﻳﻌﻤﻞ ﺑﻪ ﺑﻌﺪ ﻣﺮﻭﺭ ﺷﻬﺮ ﻋﻠﻰ ﻧﺸﺮﻩ ﻓﻲ ﺍﻟﺠﺮﻳﺪﺓ ﺍﻟﺮﺳﻤﻴﺔ.

ﺍﻟﻤﺎﺩﺓ (2) ﻳﻜﻮﻥ ﻟﻠﻌﺒﺎﺭﺍﺕ ﻭﺍﻻﻟﻔﺎﻅ ﺍﻟﺘﺎﻟﻴﺔ ﺍﻟﻮﺍﺭﺩﺓ ﻓﻲ ﻫﺬﺍ ﺍﻟﻘﺎﻧﻮﻥ ﺍﻟﻤﻌﺎﻧﻲ ﺍﻟﻤﺨﺼﺼﺔ ﻟﻬﺎ ﺃﺩﻧﺎﻩ ﺍﻻ ﺍﺫﺍ ﺩﻟﺖ ﺍﻟﻘﺮﻳﻨﺔ ﻋﻠﻰ ﺧﻼﻑ ﺫﻟﻚ:
ﺗﻌﻨﻲ ﻟﻔﻈﺔ (ﺍﻟﻤﻤﻠﻜﺔ): ﺍﻟﻤﻤﻠﻜﺔ ﺍﻻﺭﺩﻧﻴﺔ ﺍﻟﻬﺎﺷﻤﻴﺔ. ﻭﺗﺸﻤﻞ ﻋﺒﺎﺭﺓ (ﺍﻻﺟﺮﺍءﺍﺕ ﺍﻟﻘﻀﺎﺋﻴﺔ :) ﻛﺎﻓﺔ ﺍﻻﺟﺮﺍءﺍﺕ ﺍﻟﺘﻲ ﺗﺘﺨﺬ ﺃﻣﺎﻡ ﺃﻳﺔ ﻣﺤﻜﻤﺔ ﺃﻭ ﻣﺪﻋﻲ ﻋﺎﻡ ﺃﻭ ﻣﺠﻠﺲ ﻗﻀﺎﺋﻲ، ﺍﻭ ﻟﺠﻨﺔ ﺗﺤﻘﻴﻖ ﺃﻭ ﺷﺨﺺ ﻳﺠﻮﺯ ﺍﺩﺍء ﺍﻟﺸﻬﺎﺩﺓ ﺃﻣﺎﻣﻬﺎ ﺃﻭ ﺃﻣﺎﻣﻪ ﺑﻌﺪ ﺣﻠﻒ ﺍﻟﻴﻤﻴﻦ ﺳﻮﺍء ﻗﺎﻣﺖ ﻫﺬﻩ ﺍﻟﻤﺤﻜﻤﺔ ﺍﻭ ﺍﻟﻤﺠﻠﺲ ﺍﻟﻘﻀﺎﺋﻲ ﺃﻭ ﺍﻟﻠﺠﻨﺔ ﺃﻭ ﺫﻟﻚ ﺍﻟﺸﺨﺺ ﺑﺴﻤﺎﻉ ﺍﻟﺸﻬﺎﺩﺓ ﺑﻌﺪ ﺍﻟﻴﻤﻴﻦ ﺃﻭ ﺑﺪﻭﻥ ﺍﻟﻴﻤﻴﻦ. ﻭﺗﻌﻨﻲ ﻋﺒﺎﺭﺓ (ﺑﻴﺖ ﺍﻟﺴﻜﻦ:) ﺍﻟﻤﺤﻞ ﺍﻟﻤﺨﺼﺺ ﻟﻠﺴﻜﻨﻰ ﺃﻭ ﺃﻱ ﻗﺴﻢ ﻣﻦ ﺑﻨﺎﻳﺔ ﺍﺗﺨﺬﻩ ﺍﻟﻤﺎﻟﻚ ﺃﻭ ﺍﻟﺴﺎﻛﻦ ﺍﺫ ﺫﺍﻙ ﻣﺴﻜﻨﺎً ﻟﻪ ﻭﻟﻌﺎﺋﻠﺘﻪ ﻭﺿﻴﻮﻓﻪ ﻭﺧﺪﻣﻪ ﺃﻭ ﻷﻱ ﻣﻨﻬﻢ ﻭﺍﻥ ﻟﻢ ﻳﻜﻦ ﻣﺴﻜﻮﻧﺎً ﺑﺎﻟﻔﻌﻞ ﻭﻗﺖ ﺍﺭﺗﻜﺎﺏ ﺍﻟﺠﺮﻳﻤﺔ ، ﻭﺗﺸﻤﻞﺍﻳﻀﺎً ﺗﻮﺍﺑﻌﻪ ﻭﻣﻠﺤﻘﺎﺗﻪ ﺍﻟﻤﺘﺼﻠﺔ ﺍﻟﺘﻲ ﻳﻀﻤﻬﺎ ﻣﻌﻪ ﺳﻮﺭ ﻭﺍﺣﺪ. 
ﻭﺗﺸﻤﻞ ﻋﺒﺎﺭﺓ (ﺍﻟﻄﺮﻳﻖ ﺍﻟﻌﺎﻡ :) ﻛﻞ ﻁﺮﻳﻖ ﻳﺒﺎﺡ ﻟﻠﺠﻤﻬﻮﺭ ﺍﻟﻤﺮﻭﺭ ﺑﻪ ﻓﻲ ﻛﻞ ﻭﻗﺖ ﻭﺑﻐﻴﺮ ﻗﻴﺪ ﻓﻴﺪﺧﻞ ﻓﻲ ﻫﺬﺍ ﺍﻟﺘﻌﺮﻳﻒ ﺍﻟﺠﺴﻮﺭ ﻭﻛﺎﻓﺔ ﺍﻟﻄﺮﻕ ﺍﻟﺘﻲ ﺗﺼﻞ ﺍﻟﻤﺪﻥ ﺃﻭ ﺍﻟﺒﻼﺩ ﺑﻌﻀﻬﺎ ﺑﺒﻌﺾ ﻭﻻ ﻳﺪﺧﻞ ﻓﻴﻪ ﺍﻻﺳﻮﺍﻕ ﻭﺍﻟﻤﻴﺎﺩﻳﻦ ﻭﺍﻟﺴﺎﺣﺎﺕ ﻭﺍﻟﺸﻮﺍﺭﻉ ﺍﻟﻜﺎﺋﻨﺔ ﺩﺍﺧﻞ ﺍﻟﻤﺪﻥ ﺃﻭ ﺍﻟﺒﻠﺪﺍﻥ ﺃﻭ ﺍﻟﻘﺮﻯ ﻭﺍﻻﻧﻬﺎﺭ. 
ﻭﺗﺸﻤﻞ ﻋﺒﺎﺭﺓ (ﻣﻜﺎﻥ ﻋﺎﻡ ﺃﻭ ﻣﺤﻞ ﻋﺎﻡ :) ﻛﻞ ﻁﺮﻳﻖ ﻋﺎﻡ ﻭﻛﻞ ﻣﻜﺎﻥ ﺃﻭ ﻣﻤﺮ ﻳﺒﺎﺡ ﻟﻠﺠﻤﻬﻮﺭ ﺍﻟﻤﺮﻭﺭ ﺑﻪ ﺃﻭ ﺍﻟﺪﺧﻮﻝ ﺍﻟﻴﻪ ﻓﻲ ﻛﻞ ﻭﻗﺖ ﻭﺑﻐﻴﺮ ﻗﻴﺪ ﺃﻭ ﻛﺎﻥ ﻣﻘﻴﺪﺍً ﺑﺪﻓﻊ ﻣﺒﻠﻎ ﻣﻦ ﻟﻨﻘﻮﺩ ﻭﻛﻞ ﺑﻨﺎء ﺃﻭ ﻣﻜﺎﻥ ﻳﺴﺘﻌﻤﻞ ﺇﺫ ﺫﺍﻙ ﻷﻱ ﺍﺟﺘﻤﺎﻉ ﺃﻭ ﺣﻔﻞ ﻋﻤﻮﻣﻲ ﺃﻭ ﺩﻳﻨﻲ ﺃﻭ ﻛﺴﺎﺣﺔ ﻣﻜﺸﻮﻓﺔ.
ﻭﻳﻘﺼﺪ ﺑﻠﻔﻈﺘﻲ (ﺍﻟﻠﻴﻞ(ﺃﻭ)ﻟﻴﻼً:) ﺍﻟﻔﺘﺮﺓ ﺍﻟﺘﻲ ﺗﻘﻊ ﺑﻴﻦ ﻏﺮﻭﺏ ﺍﻟﺸﻤﺲ ﻭﺷﺮﻭﻗﻬﺎ. ﻭﻳﺮﺍﺩ ﺑﻠﻔﻈﺔ (ﺍﻟﺠﺮﺡ:) ﻛﻞ ﺷﺮﻁ ﺃﻭ ﻗﻄﻊ ﻳﺸﺮﻁ ﺃﻭ ﻳﺸﻖ ﻏﺸﺎء ﻣﻦ ﺃﻏﺸﻴﺔ ﺍﻟﺠﺴﻢ ﺍﻟﺨﺎﺭﺟﻴﺔ. ﻭﺍﻳﻔﺎء ﻟﻠﻐﺮﺽ ﻣﻦ ﻫﺬﺍ ﺍﻟﺘﻔﺴﻴﺮ ، ﻳﻌﺘﺒﺮ ﺍﻟﻐﺸﺎء ﺧﺎﺭﺟﻴﺎً ﺇﺫﺍ ﻛﺎﻥ ﻓﻲ ﺍﻻﻣﻜﺎﻥ ﻟﻤﺴﻪ ﺑﺪﻭﻥ ﺷﻄﺮ ﺃﻱ ﻏﺸﺎء ﺁﺧﺮ ﺃﻭ ﺷﻘﻪ."""


# encoding = tiktoken.encoding_for_model("gpt-3.5-turbo")
encoding = tiktoken.encoding_for_model("text-davinci-003")
tokens = encoding.encode(context)

print (f"Length of tokens is :{len(tokens)}")

# decoded_text = [encoding.decode_single_token_bytes(token) for token in tokens]
# print(decoded_text)

# decoded_string = b''.join(decoded_text).decode('utf-8')
# print(decoded_string)


