str = """ﺍﻟﻤﺎﺩﺓ (2) ﻳﻜﻮﻥ ﻟﻠﻌﺒﺎﺭﺍﺕ ﻭﺍﻻﻟﻔﺎﻅ ﺍﻟﺘﺎﻟﻴﺔ ﺍﻟﻮﺍﺭﺩﺓ ﻓﻲ ﻫﺬﺍ ﺍﻟﻘﺎﻧﻮﻥ ﺍﻟﻤﻌﺎﻧﻲ ﺍﻟﻤﺨﺼﺼﺔ ﻟﻬﺎ ﺃﺩﻧﺎﻩ ﺍﻻ ﺍﺫﺍ ﺩﻟﺖ ﺍﻟﻘﺮﻳﻨﺔ ﻋﻠﻰ ﺧﻼﻑ ﺫﻟﻚ:
ﺗﻌﻨﻲ ﻟﻔﻈﺔ (ﺍﻟﻤﻤﻠﻜﺔ): ﺍﻟﻤﻤﻠﻜﺔ ﺍﻻﺭﺩﻧﻴﺔ ﺍﻟﻬﺎﺷﻤﻴﺔ. ﻭﺗﺸﻤﻞ ﻋﺒﺎﺭﺓ (ﺍﻻﺟﺮﺍءﺍﺕ ﺍﻟﻘﻀﺎﺋﻴﺔ :) ﻛﺎﻓﺔ ﺍﻻﺟﺮﺍءﺍﺕ ﺍﻟﺘﻲ ﺗﺘﺨﺬ ﺃﻣﺎﻡ ﺃﻳﺔ ﻣﺤﻜﻤﺔ ﺃﻭ ﻣﺪﻋﻲ ﻋﺎﻡ ﺃﻭ ﻣﺠﻠﺲ ﻗﻀﺎﺋﻲ، ﺍﻭ ﻟﺠﻨﺔ ﺗﺤﻘﻴﻖ ﺃﻭ ﺷﺨﺺ ﻳﺠﻮﺯ ﺍﺩﺍء ﺍﻟﺸﻬﺎﺩﺓ ﺃﻣﺎﻣﻬﺎ ﺃﻭ ﺃﻣﺎﻣﻪ ﺑﻌﺪ ﺣﻠﻒ ﺍﻟﻴﻤﻴﻦ ﺳﻮﺍء ﻗﺎﻣﺖ ﻫﺬﻩ ﺍﻟﻤﺤﻜﻤﺔ ﺍﻭ ﺍﻟﻤﺠﻠﺲ ﺍﻟﻘﻀﺎﺋﻲ ﺃﻭ ﺍﻟﻠﺠﻨﺔ ﺃﻭ ﺫﻟﻚ ﺍﻟﺸﺨﺺ ﺑﺴﻤﺎﻉ ﺍﻟﺸﻬﺎﺩﺓ ﺑﻌﺪ ﺍﻟﻴﻤﻴﻦ ﺃﻭ ﺑﺪﻭﻥ ﺍﻟﻴﻤﻴﻦ. ﻭﺗﻌﻨﻲ ﻋﺒﺎﺭﺓ (ﺑﻴﺖ ﺍﻟﺴﻜﻦ:) ﺍﻟﻤﺤﻞ ﺍﻟﻤﺨﺼﺺ ﻟﻠﺴﻜﻨﻰ ﺃﻭ ﺃﻱ ﻗﺴﻢ ﻣﻦ
"""

str = """ﻗﺎﻧﻮﻥ ﺍﻟﻌﻘﻮﺑﺎﺕ ﺭﻗﻢ 16 1960/ ﻭﺟﻤﻴﻊ ﺗﻌﺪﻳﻼﺗﻪ ﻭﺍﻟﻤﻨﺸﻮﺭ ﻓﻲ ﺍﻟﺠﺮﻳﺪﺓ ﺍﻟﺮﺳﻤﻴﺔ ﺭﻗﻢ 1487 ﺗﺎﺭﻳﺦ 1960/1/1 ﻭﺍﻟﻤﻌﺪﻝ ﺑﺂﺧﺮ ﻗﺎﻧﻮﻥ
ﺭﻗﻢ 2011/8 ﻭﺍﻟﻤﻨﺸﻮﺭ ﻓﻲ ﺍﻟﺠﺮﻳﺪﺓ ﺍﻟﺮﺳﻤﻴﺔ ﺭﻗﻢ 5090 ﺗﺎﺭﻳﺦ 2011/5/2

ﺍﻟﻤﺎﺩﺓ (1)
ﻳﺴﻤﻰ ﻫﺬﺍ ﺍﻟﻘﺎﻧﻮﻥ (ﻗﺎﻧﻮﻥ ﺍﻟﻌﻘﻮﺑﺎﺕ ﻟﺴﻨﺔ 1960) ﻭﻳﻌﻤﻞ ﺑﻪ ﺑﻌﺪ ﻣﺮﻭﺭ ﺷﻬﺮ ﻋﻠﻰ ﻧﺸﺮﻩ ﻓﻲ ﺍﻟﺠﺮﻳﺪﺓ ﺍﻟﺮﺳﻤﻴﺔ.

"""


str = """2)ﺍﻟﺼﻼﺣﻴﺔ ﺍﻟﺬﺍﺗﻴﺔ
ﺍﻟﻤﺎﺩﺓ (9) ﺗﺴﺮﻯ ﺃﺣﻜﺎﻡ ﻫﺬﺍ ﺍﻟﻘﺎﻧﻮﻥ ﻋﻠﻰ ﻛﻞ ﺍﺭﺩﻧﻲ ﺃﻭ ﺍﺟﻨﺒﻲ – ﻓﺎﻋﻼً ﻛﺎﻥ ﺍﻭ ﺷﺮﻳﻜﺎً ﻣﺤﺮﺿﺎً ﺍﻭ ﻣﺘﺪﺧﻼً – ﺍﺭﺗﻜﺐ ﺧﺎﺭﺝ ﺍﻟﻤﻤﻠﻜﺔ ﺟﻨﺎﻳﺔ ﺍﻭ ﺟﻨﺤﺔ ﻣﺨﻠﺔ ﺑﺄﻣﻦ ﺍﻟﺪﻭﻟﺔ ﺍﻭ ﻗﻠﺪ ﺧﺘﻢ ﺍﻟﺪﻭﻟﺔ ﺍﻭ ﻗﻠﺪ ﻧﻘﻮﺩﺍ ﺍﻭ ﺯﻭﺭ ﺍﻭﺭﺍﻕ ﺍﻟﻨﻘﺪ ﺍﻭ ﺍﻟﺴﻨﺪﺍﺕ ﺍﻟﻤﺼﺮﻓﻴﺔ ﺍﻷﺭﺩﻧﻴﺔ ﺃﻭ ﺍﻷﺟﻨﺒﻴﺔ ﺍﻟﻤﺘﺪﺍﻭﻟﺔ ﻗﺎﻧﻮﻧﺎ ﺍﻭ ﺗﻌﺎﻣﻼ ﻓﻲ ﺍﻟﻤﻤﻠﻜﺔ.

(3)ﺍﻟﺼﻼﺣﻴﺔ ﺍﻟﺸﺨﺼﻴﺔ
ﺍﻟﻤﺎﺩﺓ (10) ﺗﺴﺮﻱ ﺃﺣﻜﺎﻡ ﻫﺬﺍ ﺍﻟﻘﺎﻧﻮﻥ: 1-ﻋﻠﻰ ﻛﻞ ﺃﺭﺩﻧﻲ – ﻓﺎﻋﻼً ﻛﺎﻥ ﺃﻭ ﺷﺮﻳﻜﺎً ﻣﺤﺮﺿﺎً ﺃﻭ ﻣﺘﺪﺧﻼً – ﺍﺭﺗﻜﺐ ﺧﺎﺭﺝ ﺍﻟﻤﻤﻠﻜﺔ ﺟﻨﺎﻳﺔ ﺃﻭ ﺟﻨﺤﺔ ﻳﻌﺎﻗﺐ ﻋﻠﻴﻬﺎ ﺍﻟﻘﺎﻧﻮﻥ ﺍﻷﺭﺩﻧﻲ. ﻛﻤﺎ ﺗﺴﺮﻱ ﺍﻷﺣﻜﺎﻡ ﺍﻟﻤﺬﻛﻮﺭﺓ ﻋﻠﻰ ﻣﻦ ﺫﻛﺮ ﻭﻟﻮ ﻓﻘﺪ ﺍﻟﺠﻨﺴﻴﺔ ﺍﻷﺭﺩﻧﻴﺔ ﺍﻭ ﺍﻛﺘﺴﺒﻬﺎ ﺑﻌﺪ ﺍﺭﺗﻜﺎﺏ ﺍﻟﺠﻨﺎﻳﺔ ﺃﻭ ﺍﻟﺠﻨﺤﺔ. 2-ﻋﻠﻰ ﺍﻟﺠﺮﺍﺋﻢ ﺍﻟﺘﻲ ﻳﺮﺗﻜﺒﻬﺎ ﺧﺎﺭﺝ ﺍﻟﻤﻤﻠﻜﺔ ﺃﻱ ﻣﻮﻅﻒ ﺃﺭﺩﻧﻲ ﺃﺛﻨﺎء ﻣﻤﺎﺭﺳﺘﻪ ﻭﻅﻴﻔﺘﻪ ﺃﻭ ﺑﻤﻨﺎﺳﺒﺔ ﻣﻤﺎﺭﺳﺘﻪ ﺇﻳﺎﻫﺎ. 3-ﻋﻠﻰ ﺍﻟﺠﺮﺍﺋﻢ ﺍﻟﺘﻲ ﻳﺮﺗﻜﺒﻬﺎ ﺧﺎﺭﺝ ﺍﻟﻤﻤﻠﻜﺔ ﻣﻮﻅﻔﻮ ﺍﻟﺴﻠﻚ ﺍﻟﺨﺎﺭﺟﻲ ، ﻭﺍﻟﻘﻨﺎﺻﻞ ﺍﻷﺭﺩﻧﻴﻮﻥ ﻣﺎ ﺗﻤﺘﻌﻮﺍ ﺑﺎﻟﺤﺼﺎﻧﺔ ﺍﻟﺘﻲ ﻳﺨﻮﻟﻬﻢ ﺇﻳﺎﻫﺎ ﺍﻟﻘﺎﻧﻮﻥ ﺍﻟﺪﻭﻟﻲ ﺍﻟﻌﺎﻡ. 4-ﻋﻠﻰ ﻛﻞ ﺃﺟﻨﺒﻲ ﻣﻘﻴﻢ ﻓﻲ ﺍﻟﻤﻤﻠﻜﺔ ﺍﻻﺭﺩﻧﻴﺔ ﺍﻟﻬﺎﺷﻤﻴﺔ ، ﻓﺎﻋﻼً ﻛﺎﻥ ﺃﻭ ﺷﺮﻳﻜﺎً ﻣﺤﺮﺿﺎً ﺃﻭ ﻣﺘﺪﺧﻼً ، ﺍﺭﺗﻜﺐ ﺧﺎﺭﺝ ﺍﻟﻤﻤﻠﻜﺔ ﺍﻻﺭﺩﻧﻴﺔ ﺍﻟﻬﺎﺷﻤﻴﺔ ﺟﻨﺎﻳﺔ ﺃﻭ ﺟﻨﺤﺔ ﻳﻌﺎﻗﺐ ﻋﻠﻴﻬﺎ ﺍﻟﻘﺎﻧﻮﻥ ﺍﻷﺭﺩﻧﻲ. ﺍﺫﺍ ﻟﻢ ﻳﻜﻦ ﺍﺳﺘﺮﺩﺍﺩﻩ ﻗﺪ ﻁﻠﺐ ﺃﻭ ﻗﺒﻞ.
ﺍﻟﻤﺎﺩﺓ (11) ﻻ ﺗﺴﺮﻱ ﺍﺣﻜﺎﻡ ﻫﺬﺍ ﺍﻟﻘﺎﻧﻮﻥ ﻋﻠﻰ ﺍﻟﺠﺮﺍﺋﻢ ﺍﻟﺘﻲ ﻳﺮﺗﻜﺒﻬﺎ ﻓﻲ ﺍﻟﻤﻤﻠﻜﺔ ﻣﻮﻅﻔﻮ ﺍﻟﺴﻠﻚ ﺍﻟﺨﺎﺭﺟﻲ ﻭﺍﻟﻘﻨﺎﺻﻞ ﺍﻻ ﺟﺎﻧب ﻣﺎ ﺗﻤﺘﻌﻮﺍ ﺑﺎﻟﺤﺼﺎﻧﺔ ﺍﻟﺘﻲ ﻳﺨﻮﻟﻬﻢ ﺍﻳﺎﻫﺎ ﺍﻟﻘﺎﻧﻮﻥ ﺍﻟﺪﻭﻟﻲ ﺍﻟﻌﺎﻡ.

(4)ﻣﻔﻌﻮﻝ ﺍﻷﺣﻜﺎﻡ ﺍﻷﺣﻜﺎﻡ ﺍﻷﺟﻨﺒﻴﺔ
ﺍﻟﻤﺎﺩﺓ (12) ﻓﻴﻤﺎ ﺧﻼ ﺍﻟﺠﻨﺎﻳﺎﺕ ﺍﻟﻤﻨﺼﻮﺹ ﻋﻠﻴﻬﺎ ﻓﻲ ﺍﻟﻤﺎﺩﺓ (9) ﻭﺍﻟﺠﺮﺍﺋﻢ ﺍﻟﺘﻲ ﺍﺭﺗﻜﺒﺖ ﻓﻲ ﺍﻟﻤﻤﻠﻜﺔ ﻻ ﻳﻼﺣﻖ ﻓﻲ ﻫﺬﻩ ﺍﻟﻤﻤﻠﻜﺔ ﺍﺭﺩﻧﻲ ﺃﻭ ﺍﺟﻨﺒﻲ ﺇﺫﺍ ﻛﺎﻥ ﻗﺪ ﺟﺮﺕ ﻣﺤﺎﻛﻤﺘﻪ ﻧﻬﺎﺋﻴﺎً ﻓﻲ ﺍﻟﺨﺎﺭﺝ ، ﻭﻓﻲ ﺣﺎﻟﺔ ﺍﻟﺤﻜﻢ ﻋﻠﻴﻪ ﺇﺫﺍ ﻛﺎﻥ ﺍﻟﺤﻜﻢ ﻗﺪ ﻧﻔﺬ ﻓﻴﻪ ﺍﻭ ﺳﻘﻂ ﻋﻨﻪ ﺑﺎﻟﺘﻘﺎﺩﻡ ﺃﻭ ﺑﺎﻟﻌﻔﻮ.
ﺍﻟﻤﺎﺩﺓ (13)
1-ﻻ ﺗﺤﻮﻝ ﺩﻭﻥ ﺍﻟﻤﻼﺣﻘﺔ ﻓﻲ ﺍﻟﻤﻤﻠﻜﺔ:
ﺃ- ﺍﻷﺣﻜﺎﻡ ﺍﻟﺼﺎﺩﺭﺓ ﻓﻲ ﺍﻟﺨﺎﺭﺝ ﻓﻲ ﺃﻳﺔ ﺟﺮﻳﻤﺔ ﻣﻦ ﺍﻟﺠﺮﺍﺋﻢ ﺍﻟﻤﺒﻴﻨﺔ ﻓﻲ ﺍﻟﻤﺎﺩﺓ (.9)
ﺏ- ﺍﻷﺣﻜﺎﻡ ﺍﻟﺼﺎﺩﺭﺓ ﻓﻲ ﺍﻟﺨﺎﺭﺝ ﻓﻲ ﺃﻳﺔ ﺟﺮﻳﻤﺔ ﺍﻗﺘﺮﻓﺖ ﺩﺍﺧﻞ ﺍﻟﻤﻤﻠﻜﺔ.
2-ﻭﻓﻲ ﻛﻠﺘﺎ ﺍﻟﺤﺎﻟﺘﻴﻦ ﺗﻤﺘﻨﻊ ﺍﻟﻤﻼﺣﻘﺔ ﻓﻲ ﺍﻟﻤﻤﻠﻜﺔ ﺍﺫﺍ ﻛﺎﻥ ﺣﻜﻢ ﺍﻟﻘﻀﺎء ﺍﻷﺟﻨﺒﻲ ﻗﺪ ﺻﺪﺭ ﻋﻠﻰ ﺃﺛﺮ ﺍﺧﺒﺎﺭ ﺭﺳﻤﻲ ﻣﻦ ﺍﻟﺴﻠﻄﺎﺕ ﺍﻻﺭﺩﻧﻴﺔ. 
3-ﺇﻥ ﻣﺪﺓ ﺍﻟﻘﺒﺾ ﻭﺍﻟﺘﻮﻗﻴﻒ ﻭﺍﻟﺤﻜﻢ ﺍﻟﺘﻲ ﻳﻜﻮﻥ ﻗﺪ ﻗﻀﺎﻫﺎ ﺍﻟﻤﺤﻜﻮﻡ ﻋﻠﻴﻪ ﻧﺘﻴﺠﺔ ﺇﺟﺮﺍء ﺿﺎﺑﻄﺔ ﻋﺪﻟﻴﺔ ﺃﻭ ﺇﺟﺮﺍء ﻗﻀﺎﺋﻲ ﺃﻭ ﺣﻜﻢ ﻧﻔﺬ ﻓﻴﻪ ﻓﻲ ﺍﻟﺨﺎﺭﺝ ﺗﻨﺰﻝ ﻣﻦ ﺃﺻﻞ ﺍﻟﻤﺪﺓ ﺍﻟﺘﻲ ﺣﻜﻢ ﻋﻠﻴﻪ ﺑﻬﺎ ﻓﻲ ﺍﻟﻤﻤﻠﻜﺔ.
#"""


print(len(str))